[
    {
        "speaker": "Connor Shorten",
        "content": "Hey, everyone. Thank you so much for watching the Weaviate podcast. I'm super excited to welcome Yana Welinder, the CEO and founder of Kraftful. Kraftful is one of the chatGPT plugins that has captured my imagination on what this kind of thing could look like. It's really shown me what this kind of idea of a product manager kind of compressed into prompt templates and all these things. So I'm so excited to welcome Yana to the podcast. I also, so I reached out to Yana asking if she'd join the podcast to talk about Kraftful and also did some more research on Yana. And you have such an amazing background in Stanford Law School and all these cool things. I think you'll offer so much information to the podcast and our listeners, hopefully. So Yana, thank you so much for joining the podcast. ",
        "podNumber": 52,
        "clipNumber": 1
    },
    {
        "speaker": "Yana Welinder",
        "content": "Thanks for having me. Really, really excited to be here. ",
        "podNumber": 52,
        "clipNumber": 2
    },
    {
        "speaker": "Connor Shorten",
        "content": "Awesome. So could we maybe start with maybe like the overview of Kraftful and then I think we could dive more into the product management, the components of it, and then maybe come back into the chatGPT marketplace? ",
        "podNumber": 52,
        "clipNumber": 3
    },
    {
        "speaker": "Yana Welinder",
        "content": "Absolutely. Yeah. So, so Kraftful, we're building this complete co-pilot for product managers and other product builders with this idea that our number one place where we start is to help you make sense of all the different user data that you're getting from various sources. We also help you understand kind of how to do product management really well. That's really where our plugin comes into play. But over time, we want to be that co-pilot for product builders to automate away all the tedious tasks so that folks can focus on the stuff they're really, really passionate about, like building awesome products using all of this information. ",
        "podNumber": 52,
        "clipNumber": 4
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, it's amazing. I mean, because to me, it's like the workflows, the common skills that are used across product management that you've abstracted into prompts. Can you kind of talk a little bit more like, I know user feedback is one example I saw on Kraftful. ",
        "podNumber": 52,
        "clipNumber": 5
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah, absolutely. So I think user feedback is really kind of like one of the most important roles of a product manager is to really understand the user and understand the user needs. And so that involves collecting user feedback, but also, you know, deciphering that feedback, right? From lots of different sources. So that's both qualitative user feedback, like user interview notes and surveys and quantitative. So usage data, analytics, that kind of stuff. But on the qualitative side, I would say kind of the best PMs tend to not just use the stuff that they get from surveys and user interview notes, because usually with that, you're gathering a small group of people and you're asking them lots of questions. So it's not necessarily super representative of your user base. And even if you can manage to get it very representative, it tends to be quite detached from the experience itself. You also have this volume of user feedback that the company gets through various channels that can sometimes be much more in the flow of a user actually using a product and having an experience and giving you feedback on that. So that's things like obviously app store reviews, but also support tickets, sales call transcripts, all of that body of feedback you really want to be able to incorporate into the product development process. But then, of course, the PM then has all of these other things that they're supposed to be doing that's much more in their day to day, like communicating with stakeholders, coordinating the dev team. All of those individuals are constantly kind of like screaming at the PM. The users are not doing that in the same kind of way where it's visible, whether you listen to the users or you don't, right? So that tends to get almost deprioritized even though it's the most critical component of product management. ",
        "podNumber": 52,
        "clipNumber": 6
    },
    {
        "speaker": "Connor Shorten",
        "content": "And so there are some kind of like typical best practices for managing user feedback that say, like, professional product managers would study. And so are these then compressed into prompts and then that? So like the chatGPT plugin, is it like a set of prompts for, you know, here's a CSV with data about like a user interview study we did. And then so the prompt is like how to analyze the data and like chat with Connor, the product manager. ",
        "podNumber": 52,
        "clipNumber": 7
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah. So I guess one thing that I should kind of clarify up front is what our plugin does today is is just a subset of what Kraftful does, which actually does not include analysis of user feedback as it is today. And I can talk about kind of why we made those product choices. And there's a lot that went into kind of the defining scope of the plugin versus the full product. But in the full product, that's exactly right. And so we really are applying certain prompts to user feedback to get the kind of insights you would want to get out of the feedback to be able to make the product better. Specifically, we're, we're trying to get at the feature requests, what people love about the product, what they complain about the product. And then we've designed a flow where you get by default, these kind of general product topics. And then you can dive deeper and we tell you what kind of questions you may want to ask to get at more kind of insightful information specific to your products and features out of all of the body of user feedback. And we do that with the chat that has kind of a personality or the reasoning of a product manager so that it's not exactly like chat, that it's just a different personality, which is like, it's not as chatty, it's not as fun. It's much more of a PM. ",
        "podNumber": 52,
        "clipNumber": 8
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, that's so interesting. So it's like a, it's like a role playing, you have like role playing prompts where you add some extra context, like, because I remember like being like, in the beginning of chat, you would see people be like, you are Yann LeCun, like famous AI scientist, and it would result in a better response by kind of prompting it that way. I mean, so, so I guess the other thing, like we think about a lot about like retrieval, augmented generation, and we get vector databases, like, you know, how do you take your specific information, and then you take a search query, retrieve the specific information past the language model, you know, to get better responses. Is that kind of a part of Kraftful as well as is creating like this, you know, information store of product management best practices so that so that you kind of, you know, and then you offer that as the product. ",
        "podNumber": 52,
        "clipNumber": 9
    },
    {
        "speaker": "Yana Welinder",
        "content": "We have we kind of have two, essentially two flows. One is one is around user feedback analysis. And the other is around looking at all the different product best practices that are out, the internet is a very noisy place when it comes to product in particular, because everyone sort of think of themselves as a person. There's just so much information out there, that if you just ask, ask this question to the internet, or ask it to the internet via chat GPT, you're not likely to get very insightful answers, or they may seem insightful, but they're not necessarily going to be. And so we really try to almost curate what is what are the actual best practices that what is that body of feedback so that we can guide you through that. And then ultimately, we want those two, those two features to meet in the middle, where actually the analysis is leveraging the best practices so that we can, other than just our best practices that we already kind of built into the product to constantly evolve based on all of the different kind of the different flows and channels that we're getting. ",
        "podNumber": 52,
        "clipNumber": 10
    },
    {
        "speaker": "Connor Shorten",
        "content": "It's, it's like so amazing how, yeah, you take such a complex algorithm, like, you know, being a product manager, and you compress, you turn it into software in this new kind of paradigm that I think there's so many interesting things that the first of which that I want to break apart is this concept of like, you know, you've curated this information, do you think like the value going forward of having a highly curated set of information will increase over time because of products like this and the chatGPT? ",
        "podNumber": 52,
        "clipNumber": 11
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah, I mean, I think I think generally just like classifying what is high quality and what is not, I think over time, just based on usage, there's probably going to be lots of data there that will help determine what what's a what's a high quality source versus a low quality source. I don't I don't imagine this being kind of like the relevancy algorithm in Google, but something because that too is not necessarily doesn't give you a real sense of quality necessarily. It just it's a sense of popularity. But something like that, I think over time, I imagine being part of both specific tools like ours, and also just generally kind of like chatGPT and other chatbots that they become better at getting a sense of what's good and what's bad over time, based on, you know, just having humans in the loop and interacting with it with the feedback. ",
        "podNumber": 52,
        "clipNumber": 12
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, it makes me think a lot about like the future of kind of like content creation, kind of and like how you interact with people's content, like, you know, I trust your advice for product management. So like, whatever you're curating, like, as it is now, it's like, say, you know, you had a YouTube channel where you were kind of like, saying, here's the news about here's, here's the new stuff. And now it's like, instead of just kind of creating like videos or blog posts and stuff, now you create like this, this thing that is like, it's like a it is like software from your knowledge, kind of that is to me, it's like a new kind of course, almost like it's like, it's, yeah, like the evolution of like information products. I think it's quite fascinating with this thing. So maybe pivoting topics, I really wanted to get your perspective on kind of the chatGPT marketplace. And you mentioned that Kraftful. So it sounds like you're you're on both sides of the fence where the API lives in Kraftful, which is like your software, and then you also bring it to the plugin marketplace. How are you seeing these two things? ",
        "podNumber": 52,
        "clipNumber": 13
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah. So in on our side, on the Kraftful side, we obviously we leverage a lot of different models. So it's a combination of both both the turbo model, which is really the only thing that that our plugin gets to interact with, but also GPT3 and GPT4. And then we have various ways to combine that together to be able to interact with something that's a much larger than the context window that we would be able to leverage directly. So that's a very different and that's kind of what we need to have for this like, body of feedback where you're constantly feeding support tickets, right? Like that's going to be a ton of data. And then on the other side of that, in the plugin, we were actually very, very early with developing our plugin, I think we were in the first cohort of developers developing ours, we launched, we were in the first group of folks launching it in the plugin store. And in fact, that was sort of an interesting aspect in its own right, because when we launched, there wasn't a whole lot of users that had access to plugins. So we weren't getting feedback just in the very early days. People adopted and start getting feedback on it. But one thing that we've been really mindful of, when designing our plugin, or thinking through what's what, what features should we offer today, that's not that's not to say that over time, it's not going to have much more of what what Kraftful is today. But the the kind of things we're thinking about is what is that user experience look like? And what's easy for a user to do through a plugin? I think there I was very much leaning on and in a prior life prior to Kraftful, I was head of product at IFTTT, or IFTTT, if you've heard of it by any any of those names. And in, in, and so obviously, we were this integrations platform, where users were enabling integrations between different products, via IFTTT. And the big observation for me was always that authentication was really the drop off in the user experience. And so any point where you have to authenticate, and then second to that was any kind of settings. And so we really were mindful of that, that this is this is a very new user experience, that's going to be really tricky for people to kind of understand, okay, chatGPT in itself is new, then plugins on top of that are new. Users are going to struggle with that. So if we, on top of that, add on anything that requires authentication, and then have, you know, specific settings that we kind of need to have for for the kind of experience we currently have on Kraftful proper, that's probably going to mean that no one's going to use that plugin. So we're sort of just thinking through out of all the things that Kraftful is, what can we bring to chatGPT that's actually gonna be valuable and people will use. And so that's where the product coach was, came into place. It's like, that's, you don't need to authenticate anything. You don't, you can really just start using it and ask it questions and about best practices. And in that, I think so far, it's turned out to be true. Like people have had lots of use of it, because it's been so easy to use compared to, you know, some, some of the other plugins, because it's just, it's, it's, it's complicated. It's gonna get easier over time, but it is so far, it's complicated to use. ",
        "podNumber": 52,
        "clipNumber": 14
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, that's so powerful. I think it makes me think, like, I don't know if this is too much of a, like too much of a stretch to compare it to say, like how you kind of tailor your content to different, like social media platforms, like to Twitter, I write a short, you know, description of text, Medium, I write a long article, like, and so it's like, you've, you've taken apart a particular part of your product that fit that can live on the plugin marketplace, but then the, the, your website has more functionality. ",
        "podNumber": 52,
        "clipNumber": 15
    },
    {
        "speaker": "Yana Welinder",
        "content": "And so basically, I think an even better, better knowledge. That's a great analogy. But then the other thing is sort of like how you've previously would be designing your product to be to live on web in one context, because that's where you're sitting next to your computer, versus on your phone, right? Like you're on, on the go, you're gonna want things more short form, that's kind of why Twitter is short form too. And sort of there, there's already examples of that where you're developing products for different platforms. And, and you have kind of have to take into account what's that user experience look like? ",
        "podNumber": 52,
        "clipNumber": 16
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, that's definitely a better example. We, um, so I think so with but when you do have user data, you can get a much better experience because you know, it becomes like a data management platform. So is, so can you walk me through a little more about how the full Kraftful works, how it collects all the data and sends out to chatGPT and just kind of how you think about that kind of system design? ",
        "podNumber": 52,
        "clipNumber": 17
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah, absolutely. So on on Kraftful, users sign in, and then the very first thing they're invited to do, because we really want you to have that aha moment as quickly as possible, is to connect your data sources. And so you can do things like connect your support tickets, that's usually an OAuth, or you can select an app from, from iOS or Android apps, and then you load App Store reviews for that app. Or you can upload CSV files or, or just a text doc to analyze that's usually for things like user interview notes, or, or call transcripts. And then we run a combination of prompts on all of that feedback. So we pull, we pull in all of that feedback, we break it down when it's a large volume of feedback, and we kind of, we do what we call it, it's kind of summaries of summaries, where we run types of prompts to summarize it in certain ways. And then we apply these product prompts on, on this data to get product insights from them. And then on top of that, we in with with that, we use a combination of GPT3, GPT4, and actually also turbo because, because it does make sense in certain contexts. And then, and then, then there's two things you can do with that one is you can you can chat with summaries of feedback on top of that to kind of learn more beyond specifically what we the insights that we pulled out for you automatically. And then the other thing you can do is to use something that we call our reverse analysis, where we actually do the opposite, where we associate summaries that we got kind of the product specific summaries that we got to the original feedback so that you can read that feedback in context and learn more about what the user actually wanted, or what you don't kind of like a little bit more about what what's actually their problem beyond specifically what they're asking for. ",
        "podNumber": 52,
        "clipNumber": 18
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, there's um, so I think a couple things as far as firstly, I think that that kind of like summarization prompts, I think just hearing again, your like how you're using it is just a testimony to the power of that prompt, like, you know, some prompt like, please summarize the following documents, you'll receive them one at a time as well as a summary so far and just looping through that, that problem has added so much value in so many ways. So I definitely want to ask this kind of topic of like prompt engineering, like this kind of idea of tweaking your prompts, how much do you kind of tweak these prompts? Is it about like, discovering totally new concepts like the summaries or you mentioned this kind of like, invert the feedback kind of is that like a prompt as well? Or is it just like linking? ",
        "podNumber": 52,
        "clipNumber": 19
    },
    {
        "speaker": "Yana Welinder",
        "content": "It is so we've, I would say like the origin, the first prompts, the earliest prompts for what we have on Google, on Kraftful, I kind of wrote back in like early 2020. And since then, they've evolved so, so, so many times. I probably have lost track of. And so it's a constant evolution that is that that's a combination of how the models have evolved, because back then prompt engineering is actually so much more complex than it is today. As we like, you had to have much, much more complex prompts to get something, something meaningful at all. And at some point, you have much less prompt engineering, and you can kind of cut down on a lot of the additional stuff that you did to get reason in certain ways. So that's one, one, one kind of evolution of our prompt engineering. The other type is just as we connect the different types of sources, some that are rich with product insights, like say, user interview notes, versus some that are not so rich with with product insights, like support tickets or call transcripts, we've learned a lot from those different types of user feedback sources, and had to apply different types of prompts to get to get product insights out of them, right? Because we're not actually just summarizing the feedback, we are really just looking for very specific types of insights in all of that, that feedback. That's, that's been the kind of the other kind of evolution. And then on top of that is sort of like this additional piece around, okay, but now we're also building new features, and those new features need a completely new set of prompts to enable things like reverse analysis. ",
        "podNumber": 52,
        "clipNumber": 20
    },
    {
        "speaker": "Connor Shorten",
        "content": "So, well, I guess the other like a quick note before coming back to the prompt engineering topic is, I think in addition to that summarization chain, the other thing is like MapReduce chain where you apply like, so like, does this product review mention, let's say Ref2Vec is like a Weaviate feature, like, does this product review mention Ref2Vec, and it just applies that on each chunk of user view, and then takes those answers and aggregates them with another prompt. But yeah, I think another just another, I think like summarization chains and MapReduce, those are like two of the most like ubiquitous prompts, and then you have the specific example. And so, so you mentioned starting in 2020. So you, you know, must have been an early believer in like, because, you know, I've been also working in AI, like, you know, I was in my PhD this time, not like, like, you know, 2020, I don't, I don't think it was, you know, clear that this was going to succeed like this, like you could just tell it to do a task, and it could do the task. Yeah. So, so what made you kind of an early believer in just being able to prompt it? ",
        "podNumber": 52,
        "clipNumber": 21
    },
    {
        "speaker": "Yana Welinder",
        "content": "So I think I wasn't necessarily an early believer. And this is just one of the biggest problems I've myself experienced. So the very first time I got to play around with this technology, that's the best, this is the very problem I applied it to. And I think actually, my takeaway was that it didn't do a great job of it back then. The first prototype I built wasn't, wasn't summarizing feedback in a great way. But I could, I started seeing the promise there. And so I, I continued coming back to it, I would say, you know, it wasn't actually, we didn't have it in production until 2021. And before that, we had much more sort of like an analytics product that analyzed interaction data much more so than the user feedback. So it was much more of a experimentation to see can, can I solve this problem that I've had as a product manager? You know, and have been trying to solve through, you know, thematic analysis tools and really not been happy with with that outcome. And so when I, when I, when I got access to, to experiment with, with GPT3 back then, that's kind of the first, the first thing I applied it to. ",
        "podNumber": 52,
        "clipNumber": 22
    },
    {
        "speaker": "Connor Shorten",
        "content": "I mean, yeah, the I remember just so like the few shot prompting where you give a few examples, maybe. Yeah, wow, that's so interesting. So pivoting topics a little bit, I'm curious about, like, your use of user data at Kraftful and design of the product. Like, do you do you think about training your own large language models? Or like, you know, maybe fine tuning it for your particular problem? Or like, you know, Connor using it? ",
        "podNumber": 52,
        "clipNumber": 23
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yep. Yeah, absolutely. So I think we're definitely gonna be fine tuning a lot over time. I don't imagine us necessarily training our own model, though maybe, maybe we will over time. I think, you know, the, the pace with which this is developing, which doesn't seem like a really good use of time, our team's time specifically, because after all, we are not, we at least we don't think of ourselves as an AI company, we do think or a product, we do think of ourselves as a product management product solution. Right. And so the but I do think that's definitely fine tuning. So I mentioned that, you know, our chat behaves like a product manager. And that's, in some sense, a conceptually, what we want our product to do is we want it, you know, to the extent that all large language models are behaving more and more like a human over time, to do more and more of human tasks, we want our product to, to do the tasks, we're asking it to do more and more like a product manager, or more and more like a product manager at a specific company, as opposed to a, you know, a customer support representative, right. That's just the different type of way of analyzing data. And we want to kind of fine tune the model over time to be to perform more like that. And the way we plan on doing that is just to have users provide feedback, just not directly, but by interacting with the summaries and in all of the insights that they're getting through craftful in as they mark certain summaries for use, that's a good indication for us that that's a good summary, right? And everything that they didn't interact with, well, that's an indication that we don't want to have these kinds of summaries over time. So I think there's, there's just a natural component where we can fine tune over time just based on interaction data. ",
        "podNumber": 52,
        "clipNumber": 24
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, super interesting. And like, because kind of wearing the product hat of the product that is Kraftful. So tweaking Kraftful means tweaking the prompts that in the summarization chain, rather than tweaking that rather than like, having this whole ml ops pipeline. And so I think that's an extremely interesting kind of development with the few shots, zero shot learning abilities of the models. And yeah, like how it enables you to do that kind of thing. Yeah, maybe I don't know if this would be too, like pivoting too much. But I'm curious, I'm curious a little further, like what you mean by, you know, a particular way of looking at data from a product management, maybe if we could talk about like, your experience of your team, like and how and kind of sort of like, you know, I'm not a product manager. What does it entail? ",
        "podNumber": 52,
        "clipNumber": 25
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah, I mean, I think like, one, just to give you give you kind of a concrete example. So we get by applying various prompts, we get lists of feature requests, and then we get lists of complaints, right? And oftentimes, to a non product manager, they wouldn't necessarily know, you know, what's a what, you know, what's what specifically is the complaint versus what specifically is a feature request? They may know, but I think if you were to ask your support team to produce two lists, you may see a mix of things on those lists. And it's going to be kind of very varied. I think if you ask a product manager, it's going to be pretty, you will get pretty solid lists on like, here's your feature requests. And here's your list of complaints, you know, that may vary based on organization, there may be some specific things that are considered one thing and not the other. And so what we can imagine doing is when we present these two lists to a product manager, the user that is looking at those lists, and when they then select the features that they find interesting, and they don't select the features that they don't not that they find uninteresting, and then we can see is there like maybe a match between those features and some things that have ended up on the complaints list. That's, that's a good indication to us that actually, that's why, right? Like, so there's, there may be some things that we can do around how a PM interacts with the output that we can then use to fine tune the model to behave more like that PM in the future. ",
        "podNumber": 52,
        "clipNumber": 26
    },
    {
        "speaker": "Connor Shorten",
        "content": "It's so fascinating, just like, you know, like I working in technology, I struggle enormously with how the tree of things I could do expands, like, you know, prioritize and rank like what, which of the like, you know, you can do all these things, which ones should you do? So like, like, so, so conducting that recently, you know, you have a list of 10 features, and then you're thinking, Okay, I think we only have time to do like three of these. And then so how do you rank this? Yeah, like, how would someone like you think about how do you rank that? ",
        "podNumber": 52,
        "clipNumber": 27
    },
    {
        "speaker": "Yana Welinder",
        "content": "So that's, that's one, one aspect of why we created that reverse analysis was really to give you a sense of a how frequently did each of these things come up? And then be so you can go back to the original feedback. And that's, over time, we'll have things like if that's coming from your CRM data, it may have indications of the types of customers that are requesting one thing versus another. So it gives you kind of all the different things that you normally balance when you try to make sense of the data and, and get a sense for, okay, this is a frequently requested feature, but it's from all the users who are not going to ever pay for a product. ",
        "podNumber": 52,
        "clipNumber": 28
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, I mean, yeah, I really wanted I had, you know, I'd written down CRM, because I really like, because it seems like these AI tools are surely about to build bring a revolution in CRM and how we manage relationships. We, you know, we recently published this article about this idea of using large language models to say, right, customize advertisements for, you know, for a product. And so, you know, we're trying to do that. So, you know, I travel with my dog, whereas Bob, he likes to weightlift, so he needs to know where the gym is. So like, you write these personalized summaries. And it's like, this kind of CRM, do you think a lot about like, because it seems like you're in a similar space? It's not like quite a CRM, but it is kind of like, you know, you're in a similar space. ",
        "podNumber": 52,
        "clipNumber": 29
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah, I mean, I think there's, in our case, there's going to be other things where we we do customize how we then like the, you know, you can imagine once you have all of these summaries, you may then want to write your JIRA tickets with them. That's, that's, that's where we're going to start. Right. So you may then want to write your JIRA tickets with them. That's, that's, that's, we're working on right now. Like, right, stakeholder communication, you don't necessarily want PMs to be going around and talking with everyone where that could easily have been handled, and could be actually much more kind of sensitive to that specific person. And in a voting platform like that, politics, that isn't necessary. So I think there's, there's a lot of those kind of aspects that we will have over time. That's kind of what I mean by that whole product workflow. There's so many things there that can be can be customized, or I should say automated and then customized to this each specific individual. ",
        "podNumber": 52,
        "clipNumber": 30
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, that's a really interesting, I mean, like, just kind of my own intuition. It's like, sometimes, like, regardless of what I think might have the best payout, it's like, well, what do I want to do? Yeah, I mean, like, I'm curious what you think about this idea of like, so pivoting topics a little bit again, is like multi agent systems where you have multiple large language models playing roles. So like, I'm the product manager role playing large language model. And then these are like eight engineer role playing large language models, marketing role playing, like, what do you think about these kind of systems? ",
        "podNumber": 52,
        "clipNumber": 31
    },
    {
        "speaker": "Yana Welinder",
        "content": "I think this is quite a, yeah. Yeah, I honestly don't think that that's how or for a while. That's how teams are going to operate. I think like when you know, when we get close to like AGI, yes. But I think on the path there, I much more envision a world where you have, you know, the AI enabled PM, interacting with the AI enabled engineer and the AI marketer. And all of them are essentially just like AI operators at that point. Right? Like, no, there you have no code writers, and you have no writers. But I do still think that there's there, like on at least as far as product development, there's, there's, there is a certain aspect of human intuition that is going to be pretty difficult to replace until we are very far along. And so I don't, I think it's probably going to be less of a kind of an agent role playing development process for now. ",
        "podNumber": 52,
        "clipNumber": 32
    },
    {
        "speaker": "Connor Shorten",
        "content": "Hmm. Yeah, I agree. I guess I just find the idea to be well, I find it to be really fascinating, especially with the, you know, like the software engineering kind of part where I think a lot about how the language models can write code and also kind of like test the code that I think the way that they can change it, test it, that's the part that really inspires my imagination. I say, yeah, like this kind of feature requesting where it's like, if I have 10 features, they can, each language model could take one in parallel, start prototyping it and testing it and seeing how difficult it's going to be. And yeah.",
        "podNumber": 52,
        "clipNumber": 33
    },
    {
        "speaker": "Yana Welinder",
        "content": "I think I think that so that's a really interesting idea. I think something like that is probably going to be when I think about sort of like the AI enabled PM, like what is that AI enabling that PM then that there would be like the, the piece that is writing the product spec, right? The AI that's writing the product spec can then be challenged by the AI that's analyzing the user feedback. And you can have that that interaction, I do imagine, we'd probably have to kind of get to something that's, that's better. So as it is today, right, like the, the writing of the spec is already influenced by the user feedback, right? So there is, there's already that happening. But you can imagine it's also kind of just like being more adversarial and challenging. And, and maybe that will get at an even better outcome. ",
        "podNumber": 52,
        "clipNumber": 34
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, amazing. Um, so I kind of, um, you know, stepping back into the high level again about the kind of, like, you're, you've prompted chat to be to have a specific skill set of a product manager. Do you see like, like a lot of related skills like that, like, prompted mark, like, because it sort of started, let me set the context a little more like as you're on the plugin marketplace, I'm pretty sure Kraftful is like one of the most popular apps on there. Do you like look at the, the cohorts of who else is like doing successfully on the mehr place and see what they're building and what the trends are in successful plugin marketplace apps. ",
        "podNumber": 52,
        "clipNumber": 35
    },
    {
        "speaker": "Yana Welinder",
        "content": "We can't really do that. Other than we can see, you know, we do, we keep being listed just on Twitter as like one of the, one of, you know, one of the better plugins out there, like one of the top 10, or top 20 plugins. point that we get it. What's the other one? Because who's the other ones on the list? But so far, there's very limited analytics that you get by being on the plugin store. We've built up analytics just around how you know, how much how much questions are we getting that sort of stuff just to see what what's what does the usage look like, but we don't really have a sense on kind of early days. ",
        "podNumber": 52,
        "clipNumber": 36
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, it is pretty early days still right? Like I know we have a Weaviate, a chat GPT plugin. And I, you know, I don't work on that personally. So I don't really know what it is. But I, like, I don't know too much. I would say I've done like a hackathon around it. So I've seen people trying to build this thing. But we still have it's still not quite like App Store of it's too it's too early to say right at this current time. But but you would predict like the prediction is like, would this be like a App Store type of thing? Like, what's your sentiment on that? ",
        "podNumber": 52,
        "clipNumber": 37
    },
    {
        "speaker": "Yana Welinder",
        "content": "My sense is that there's something something like that. Yes, I do think that there's probably going to be something some interface that people interact with all of their different, you know, agents or apps. Yeah. And I, I think over time, I imagine it's probably not going to be chat, I would think it's, you know, it would be something combination of voice and, and some visual interface or, you know, something that is a little bit more intuitive. Kind of like I think we always what we always dreamt for, like something like an Alexa. But we never went in that direction. Right. But, but I think, yes, I think there's something like that is coming. And I do think that the promise is there, but it's just like very, very early days. So far. ",
        "podNumber": 52,
        "clipNumber": 38
    },
    {
        "speaker": "Connor Shorten",
        "content": "And I think you'll probably again, have a better analogy for this. But like, the the iPhone App Store, to me, it has like the mode of like, it's on the iPhone. That's what enables all the apps really. And you would say maybe the language model is that type of effect, but then you can take the API and disentangle it from the, you know, the app, the iPhone was so that's where I think is a Of course, you'd like run an Android, but is that and then I see the other side where it's like, just kind of like a marketing play, like kind of like how, you know, say product hunt has like a list of products. And so like, I see it as like, either just the marketing, like I did, I know about Kraftful, because I go to the plugin marketplace, and I click on the apps, and you know, it's ranked high. So do you see those kind of things as being the right way of thinking about it? ",
        "podNumber": 52,
        "clipNumber": 39
    },
    {
        "speaker": "Yana Welinder",
        "content": "I think so. Yeah. I mean, I think that it is it is very possible that there isn't going to be another way to interact with, like apps or products or websites, other than just going through something like chat GPT, or the chatGPT, and interacting with plugins. And in that, that would be the app interaction. And so that sense, it would be analogous to it would be in one one analogy is the app store. Another analogy would just be like, that's the browser. But like, what actually is going to be is a little bit of an up in the air right now, I think, like, the folks who are developing in this space, we all kind of have to be prepared for just going in different directions and being okay with that and kind of preparing the team that yes, you're developing this, but actually, it may end up looking like this, or, you know, like thinking of everything as being as much API enabled as it can be, because that makes it also easy to switch between different platforms and in different kind of just like your specific UIs. But yes, I do think that most likely there will be some sort of chat, like chatGPT, like experience that will be interacting with, I do think that the app store is sort of like probably a good, good analogy to that, or the app store, the iPhone, or the browser. ",
        "podNumber": 52,
        "clipNumber": 40
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah. Yeah, brilliant. I think that's all really great analysis. And so sort of wrapping up the podcast, I, you know, personally, this has really inspired my interest in Kraftful. I'm definitely gonna go play with it right after this. And, you know, I hope a lot of our listeners are people, you know, building things with we've yet and, you know, AI apps, and could maybe like you do the overview. So like someone listening who's building some kind of AI product, you maybe do the introduction to Kraftful.",
        "podNumber": 52,
        "clipNumber": 41
    },
    {
        "speaker": "Yana Welinder",
        "content": "Yeah. So yeah, so so craftful, as I think you summarize really well in the beginning, so a copilot for product managers and product builders. It's really at this point, the way to summarize all of the different user feedback that you get from from from different sources. So if you have user feedback in app store reviews, but also in Zendesk support tickets, or intercom, or various docs or CSV files that you need to summarize, you can then go in and summarize it all in Kraftful, but specifically with this product angle, and be able to connect it so that we're constantly then pulling that data and analyzing it and sending it to your mailbox, you don't have to worry about it. And you can kind of just collaborate with your team on all of the feedback. ",
        "podNumber": 52,
        "clipNumber": 42
    },
    {
        "speaker": "Connor Shorten",
        "content": "Yeah, and I think just the, like the, the, the skill of how to do user interviews is quite interesting. Like, I, you know, I did a computer science degree and was just hacking with, like, I imagine a lot of people who listen to this podcast are also just like computer scientists and don't think about like how to conduct user interviews and save this kind of data. So I think all that, yeah, the the angle of this, this, this is one of the like skill skills workflows compress into like a chatGPT-based app that has really captured my imagination more than anything else. Also, kind of in the spirit of podcast, can you maybe tell people like how to keep up with you and updates and maybe any announcements coming up? ",
        "podNumber": 52,
        "clipNumber": 43
    },
    {
        "speaker": "Yana Welinder",
        "content": "Absolutely. Yeah. So probably the best the best way to keep up with me is I'm very active on Twitter and Yana tweets there. Also, I can keep up with with Kraftful there. Our handle is just Kraftful. That probably is the easiest way to both keep up and, you know, reach out to me and connect with me. The next few things we have in the pipeline is just lots and lots of additional features. Obviously, we are using Kraftful for Kraftful. We ourselves have been overwhelmed with user feedback. We do roll out new things pretty much every every week. And so a lot of that is new integrations, new ways of analyzing the data, new ways of summarizing it, the JIRA tickets, writing functionality that kind of alluded to that's coming soon too. So lots, lots and lots of exciting stuff. ",
        "podNumber": 52,
        "clipNumber": 44
    },
    {
        "speaker": "Connor Shorten",
        "content": "Awesome. Yana, thank you so much for your perspectives on all these things. I learned so much. And yeah, it all sounds so exciting. ",
        "podNumber": 52,
        "clipNumber": 45
    },
    {
        "speaker": "Yana Welinder",
        "content": "Thanks for having me. Really fun conversation.",
        "podNumber": 52,
        "clipNumber": 46
    }
]